#Область СлужебныеПроцедурыИФункции	
	
Процедура ВКМ_ОтправитьСообщениеВТелеграмм(ТекстСообщения,ЕстьСвязь) 
	
	// Создание подключения с телеграм-ботом
	//<начало>
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());	
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Токен = Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить();
	
	Данные = Новый Структура;	Данные.Вставить("chat_id", ИдентификаторГруппы);	Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON;	ЗаписьJSON.УстановитьСтроку();	ЗаписатьJSON(ЗаписьJSON, Данные); 	СтрокаЗапроса = ЗаписьJSON.Закрыть();	
	Заголовки = Новый Соответствие;	Заголовки.Вставить("content-type", "application/json"); 
		Запрос = Новый HTTPЗапрос("bot"+Токен+"/sendMessage", Заголовки);	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);   
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);  
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		СтрокаОтвета = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета,);
		
		ЕстьСвязь = Ложь; //ошибка при отправке 
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка",УровеньЖурналаРегистрации.Информация,,,"Сообщение отправлено",);
	//<конец>
КонецПроцедуры   

Процедура ПодготовитьСообщение() Экспорт

	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.ТекстСообщения;
		ЕстьСвязь = Истина;
		ВКМ_ОтправитьСообщениеВТелеграмм(ТекстСообщения,ЕстьСвязь);
		Если ЕстьСвязь Тогда  //удаление сообщения из справочника при успешной отправке
			Выборка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

