//Договоры на абонентское обслуживание
//ВКМ_Добавление реквизитов и установка их видимости
//Кошкалда НА 

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	ВКМ_УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьВидимостьРеквизитов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_ГруппаПериодДействияДоговора.Видимость = Истина;  
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина; 
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина; 
	Иначе 
		Элементы.ВКМ_ГруппаПериодДействияДоговора.Видимость = Ложь;  
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь; 
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВКМ_СоздатьРеквизиты()
	
	ГруппаФормы = Элементы.Добавить("ВКМ_ГруппаПериодДействияДоговора", Тип("ГруппаФормы"));
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы.Заголовок = "Период действия договора";
	ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаФормы.ОтображатьЗаголовок = ИСТИНА; 
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаФормы.РастягиватьПоГоризонтали = ИСТИНА;
	
	ЭлементФормы = Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора"; 
	ЭлементФормы.Заголовок = "с";
	
	ЭлементФормы = Элементы.Добавить("ВКМ_КонецДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";   
	ЭлементФормы.Заголовок = "по";
	
	ЭлементФормы = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"));	
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";  
	
	ЭлементФормы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));	
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";

КонецПроцедуры

&НаКлиенте                                          		 
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();   
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_СоздатьРеквизиты(); 
	ВКМ_УстановитьВидимостьРеквизитов();
КонецПроцедуры

//ВКМ_Добавление реквизитов и установка их видимости
//Кошкалда НА 
//Конец
