#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	ФиксированнаяПремия(); 
	ВзаиморасчетыССотрудниками();
	СформироватьДвиженияПоУдержаниям();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения() 
	
	//Регистр расчета ДополнительныеНачисления
	Для Каждого Строка из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Сотрудник = Строка.Сотрудник;
		
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
		
КонецПроцедуры

 Процедура ФиксированнаяПремия() 
	
	 Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,    
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии * 0.13 КАК НДФЛ,
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки,
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК СуммаПремии
	                       |ИЗ
	                       |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	                       |ГДЕ
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка" );
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);    
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Движение = Движения.ВКМ_ДополнительныеНачисления[Выборка.НомерСтроки - 1];
		 Движение.Сотрудник = Выборка.Сотрудник;      
		 
		 Движение.Сумма = Выборка.СуммаПремии - Окр(Выборка.НДФЛ,0,РежимОкругления.Окр15как10);
		 
	 КонецЦикла;
	 
	 Движения.ВКМ_ДополнительныеНачисления.Записать();  
		
 КонецПроцедуры
 
Процедура ВзаиморасчетыССотрудниками()
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками Приход
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Сумма КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма; 
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияПоУдержаниям() 
	
	Для Каждого Строка из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник; 
		
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		
	КонецЦикла; 
	
		 Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии * 0.13 КАК НДФЛ,
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.НомерСтроки КАК НомерСтроки
	                       |ИЗ
	                       |	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
	                       |ГДЕ
	                       |	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка" );
	 
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);    
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		 
		 Движение.Сумма = Выборка.НДФЛ;
		 
	 КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли